package com.tikk.com.tikk.common;

import java.text.DecimalFormat;
import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

/**
 * Lazo Apostolovski (lazo.apostolovski@gmail.com)
 */
public class FrequencyAnalizer {
  public interface RealTextProvider {
    String getRealText();
  }

  private RealTextProvider textProvider;

  public FrequencyAnalizer() {
    this.textProvider = new DefaultTextProvider();
  }

  public FrequencyAnalizer(RealTextProvider textProvider) {
    this.textProvider = textProvider;
  }
  // frsi cestoten analiz za vsqja bukva kolko pati se sre6ta
  // zima bukva po bukva i gi broi. posle toa za sekoja bukva gi presmetuva procentite.
  public List<CharItem> generateList() {
    List<CharItem> chList = new ArrayList<CharItem>();
    Map<Character, Double> frequencyMap = new HashMap<Character, Double>();

    String message = textProvider.getRealText();

    int charCounter = 0;
    for (char ch : message.toCharArray()) {

      boolean isDigit = Character.isDigit(ch);

      if (!isDigit) {
        charCounter++;
        if (frequencyMap.containsKey(ch)) {
          Double count = frequencyMap.get(ch);
          count++;
          frequencyMap.put(ch, count);
        } else {
          frequencyMap.put(ch, 1d);
        }
      }
    }

    Double totalPercents = 0d;

    for (Character ch : frequencyMap.keySet()) {
      Double count = frequencyMap.get(ch);
      Double percents = (count / charCounter) * 100;

      DecimalFormat twoDForm = new DecimalFormat("#.##");
      percents = Double.valueOf(twoDForm.format(percents));

      chList.add(CharItem.with(ch, percents));
      totalPercents = totalPercents + percents;
    }

    return chList;
  }

  private class DefaultTextProvider implements RealTextProvider {


    public String getRealText() {
      return "Запознаване с концепцията на базите данни" +
          "Още от дълбока древност хората са изпитвали нужда да съхраняват информация. " +
          "Например, древните египтяни са използвали дървени плочки, за да запазват сметки­те." +
          "Тези плочки в момента се разглеждат като първите форми на файлове. В пре­дишната глава се" +
          "научихте да записвате въведената от потребителя информация в текстов файл." +
          "Обикновеният файл съхранява цялата информация в един-единствен файл и раз­личните парчета от " +
          "данни не могат да се свързват едно с друго. Този тип файлове обикновено е в текстов формат, " +
          "в който липсва форматиране и различните редове са с еднаква дължина." +
          "Друг начин за съхраняване на текст в обикновен файл е чрез разделяне на всяко парче от информацията " +
          "със запетая. Цялата информация, свързана по логически начин, се намира на един ред. " +
          "Предимството на използването на обикновен файл е, че в сравнение с базата данни той заема по-малко място." +
          "Обикновените файлове" +
          "Обикновените файлове са компромис между цена и възможности. Те предоставят ефективност и " +
          "лесен начин за работа. Поради тази причина програмистите пред­почитат да използват файлове, " +
          "когато данните просто трябва да бъдат съхранени, и цената е едно от големите ограничения. " +
          "Обаче, ако искате да съхранявате данните ефективно и да ги извличате бързо, тогава трябва да " +
          "използвате бази данни." +
          "Базите данни се използват за съхраняване на огромно количество информация. За разлика от " +
          "файловете, базите данни съхраняват информацията в структуриран формат и лесно може да се " +
          "извлече конкретна информация от тях. Тази информа­ция може да бъде под формата на текст, " +
          "дати или графики. Едно предимство на ба­зите данни пред файловете е, че можете да извлечете " +
          "определена информация, кое­то не е възможно от обикновен файл." +
          "Един прост пример за база данни е телефонният указател. Цялата информация в указателя, като имена, " +
          "адреси и телефонни номера, е съхранена в структуриран формат. Например, можете да забележите, " +
          "че имената са сортирани по азбучен ред. Това помага при търсенето на информация. Ако ви се наложи да " +
          "намерите теле­фонния номер на Иван Стоянов, можете директно да започнете търсенето в частта, " +
          "съдържаща имената, започващи с буквата И, вместо от началото на указателя." +
          "Информацията в базата данни се съхранява под формата на таблици, полета и за­писи, които играят " +
          "огромна роля в структурирането на информацията, както и в бързото и ефективно търсене. В " +
          "следващата секция ще се запознаете с концепцията на таблиците в подробности." +
          "Таблици" +
          "Повечето от вас сигурно са виждали пълните шкафове в офисите. Тези шкафове се използват за съхранение на " +
          "папки. Всеки шкаф или поне всеки рафт в шкафа, съ­държа папки от сходни категории. Например, " +
          "всички папки, свързани с продажби­те, могат да са в един шкаф, а тези, свързани с продукцията, " +
          "могат да се съхраняват в друг шкаф. По подобен начин, базата данни съдържа множество таблици и всяка " +
          "таблица поддържа информация за конкретен обект или тема. Например, таблицата ще съдържа лична информация " +
          "за всички служители в компанията. Аналогично, таблицата ще съдържа подробности за клиентите, а " +
          "табли­цата ще съдържа информация за продажбите на компанията. Както всеки шкаф си има етикет, " +
          "който ви помага, за да определите съдържанието на шкафа или рафта, без да ви се налага да отваряте " +
          "самия шкаф. По аналогичен начин всяка таблица си има уникално име, което ви помага да идентифицирате " +
          "съдържа­нието на таблицата." +
          "Нека да разгледаме една примерна база данни, поддържаща библиотека. " +
          "Тази база данни съдържа три таблици — Таблицата съдържа информация за всички книги, съхранявани в " +
          "библиотеката. Таблицата съдържа информация за всеки член, който е регистриран в библиотеката. " +
          "Накрая таблицата съдържа информация за всяка заета книга." +
          "Всички данни в базата се съхраняват в определен формат. Всяка таблица съхранява данни под " +
          "формата на редове и колони. Колоните в таблиците са познати под име­то полета, а редовете — " +
          "под името записи. Фигура показва трите таблици в базата данни." +
          "Следващите секции разглеждат в подробности различните елементи в таблиците." +
          "Полета" +
          "Както казахме по-рано, полетата са набор от информация от един и същи тип или категория.Както сигурно " +
          "си спомняте, базата данни се състои от три таблици. Таблицата ще съдържа полета, като например " +
          "идентификационен номер на книга, заглавие, жанр и цена. Таблицата ще съдържа информация, като " +
          "например уникална идентификация на члена, името му, адреса и телефонния номер. Накрая таблицата " +
          "ще съдържа информация, като например уникален номер на операцията, датата, на която книгата е " +
          "била заета, идентификационния номер на книгата, идентификационния номер на члена, който я е " +
          "заел, и датата, на която книгата трябва да се върне." +
          "Глава Щ " +
          "Както виждате, полетата я таблиците не са нищо друго освен атрибути, които най-добре описват " +
          "характеристиките на обектите в таблицата. Всички тези данни се съхраняват в отделни колони и " +
          "могат да съдържат както текстови, така и числови данни. Обаче, в зависимост от изискванията ви, " +
          "можете дори да ограничите типа на данните, които се съхраняват в дадено поле. Например, можете да ограничите " +
          "съ­държанието на полетр, което съдържа телефоните на членовете, да бъде само от цифри. Или пък " +
          "полето от таблицата да съдържа само дати. Както в случая на таблиците, полетата в таблиците също имат уникални имена, " +
          "които се използват, за да можете да ги адресирате." +
          "Можете също така да класифицирате- полетата в таблиците като задължителни или не­задължителни. " +
          "Както можете да се досетите, ако дадено поле е зададено, че е задъл­жително, то потребителят " +
          "задължително трябва да въведе информация в полето. Например, полето с името на члена не може да " +
          "бъде оставено празно. Но ако това поле е зададено като незадължително, то потребителят може да избере дали " +
          "да въ­веде или да не въведе информация в това поле. Например, членовете могат да не за­дават телефонния си " +
          "номер. Фигура показва таблицата с имената на полетата и примерни стойности." +
          "Компютърните системи и технологии през последните години включват в себе си все повече отделни науки, " +
          "създадени по необходимостта от ефективни методи и средства за автоматизи­рана обработка на големи " +
          "информационни потоци и масиви. В тази връзка особен интерес представлява развитието на така наречените " +
          "информационни технологии. В основата им стоят информационните системи. Това става върху добре развитите " +
          "теория и практика на съвременните компютърни системи и мрежи и двете техни взаимно определящи се и взаимозависими " +
          "съставни части - апаратната и програмна." +
          "Информационните системи се градят върху подредена система от данни за част от окръжава­щия ни реален свят." +
          " Тя се съхранява в изчислителните системи. Като пример за информацион­ното съдържание на една такава система " +
          "може да се посочи информацията, съхранявана във външната памет на една изчислителна система и отнасяща се до " +
          "фирмите, техните собствени­ци, стоките, които тези фирми произвеждат, съхраняват и продаваткупуват, цените " +
          "по които това става, а също така и разходите на материали и труд, използувани при тази дейност. " +
          "Тези данни могат да изразяват типични отношения в дадената предметна област. В случая това мо­гат да " +
          "бъдат формирането на производствените звена по реализацията на продукцията, управ­лението на продажбите " +
          "и финансите на фирмите и др. Подобни са случаите в областта на ме­дицинското, транспортното (въздушен, " +
          "железопътен, автобусен, морски) и др. видове инфор­мационно осигуряване на населението." +
          "При изграждането на информационно осигуряване особена роля играят Базите от данни ." +
          "Съдържанието на БД следва да се въвежда, съхранява и обработва в изчислителните системи и мрежи. След " +
          "това тази информация се предоставя на един или много нейни потребители. Те пък могат да бъдат в " +
          "непосредствена физическа близост до системата данни или на разстояние от нея." +
          "Програмното осигуряване, реализиращо всички тези операции над БД, се нарича система за управление на " +
          "базата от данни (СУБД). Съвременните СУБД дават на потребителите възможност за автоматизирана работа с данните " +
          "в абстрактни термини, несвързани с начините за физическото съхраняване на тези данни в компютъра. " +
          "СУБД осигуряват и защита на данните от случайни откази и нарушения, от несанкциониран и несинхронизиран " +
          "достъп и от гледна точка на тяхната цялостност (например, броят на продадените билети за даден полет не " +
          "може да бъде по-голям от вместимостта на определения за този полет самолет), което означава, " +
          "че системата постоянно трябва да следи за ненарушаването на основни изисквания и свойства на данните." +
          "В теорията на БД е разработена достатъчно добре идеологията за нивото на абстракция за представяне на данните. " +
          "От една страна те следва да се разглеждат на физическо ниво като последователност от битове, съхранени на " +
          "физическите носители на Изчислителната сис­тема, а от друга, тези данни представляват за потребителя съвсем " +
          "други абстракции, като например, типове и марки самолети в една транспортна система, техните пътници и екипажи, " +
          "осигуряващи определени полети и т.н. " +
          "Това са концептуални нива на разглеждане на данни­те, а част от тях могат да бъдат отнесени и към " +
          "самия потребител, който си представя и изпол­зува информацията по своему, т.е. на нивото на представленията " +
          "на данните в БД, пригот­вени специално за него и евентуално само за него." +
          "Реално съществува само физическата БД, а останалите абстракции се създават изкуствено с цел удобство " +
          "на потребителя при работата с БД. Тези нива на абстракция се осигуряват с прог­рамни средства, работещи с " +
          "данните на високо и даже свръхвисоко ниво." +
          "Ще бъде обърнато внимание на второто и третото ниво на абстракция на БД. Концептуалната БД е абстрактно изображение " +
          "на физическата БД. Концептуалната БД е абстракция на реалния свят, изградена върху концептуална схема (КС) " +
          "и въз основа на специално предложен Модел на реалния свят, наречен Модел ." +
          "Тя отразява на високо ниво предметната област за която е предназначена системата данни, като борави с " +
          "термини като фирми, стоки, цени, пътници, самолети, билети и др. Тук се вижда, че КС, " +
          "изградена въз основа на модела има твърде много общо с определението за БД, дадено";
    }
  }
}
